In [1]:
import numpy as np
import pandas as pd

In [5]:
df=pd.read_csv('uber_drives.csv',names=['start_date','end_date','category','start','stop','miles','purpose'],skiprows=1)

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.shape

(1156, 7)

In [9]:
df.size

8092

In [18]:
df.iloc[0:2]

,start_date,end_date,category,start,stop,miles,purpose
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN

In [13]:
df.head(1)

,start_date,end_date,category,start,stop,miles,purpose
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain

In [14]:
df.tail(1)

     start_date end_date category start stop    miles purpose
1155     Totals      NaN      NaN   NaN  NaN  12204.7     NaN

In [25]:
df = df.iloc[:-1]

In [26]:
df.tail(1)

,start_date,end_date,category,start,stop,miles,purpose
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1155 entries, 0 to 1154
Data columns (total 7 columns):
start_date    1155 non-null object
end_date      1155 non-null object
category      1155 non-null object
start         1155 non-null object
stop          1155 non-null object
miles         1155 non-null float64
purpose       653 non-null object
dtypes: float64(1), object(6)
memory usage: 63.2+ KB

In [29]:
df.describe(include='all')

,start_date,end_date,category,start,stop,miles,purpose
count,1155,1155,1155,1155,1155,1155.000000,653
unique,1154,1154,2,177,188,NaN,10
top,6/28/2016 23:34,6/28/2016 23:59,Business,Cary,Cary,NaN,Meeting
freq,2,2,1078,201,203,NaN,187
mean,NaN,NaN,NaN,NaN,NaN,10.566840,NaN
std,NaN,NaN,NaN,NaN,NaN,21.579106,NaN
min,NaN,NaN,NaN,NaN,NaN,0.500000,NaN
25%,NaN,NaN,NaN,NaN,NaN,2.900000,NaN
50%,NaN,NaN,NaN,NaN,NaN,6.000000,NaN
75%,NaN,NaN,NaN,NaN,NaN,10.400000,NaN
max,NaN,NaN,NaN,NaN,NaN,310.300000,NaN

In [30]:
df.count()

start_date    1155
end_date      1155
category      1155
start         1155
stop          1155
miles         1155
purpose        653
dtype: int64

In [34]:
type(df['start'].value_counts())

pandas.core.series.Series